package com.ssg.test.loop;

/**
 *
 * - 분식집 주문 받는 프로그램을 만들어 보세요.
 *     1. 메뉴선택
 *     2. 수량선택
 *     3. 추가주문여부선택
 *     4. `y`면 1번부터 다시 시작. 단 데이터는 누적.
 *     5. `n`면 주문결과서 출력
 */
public class Test6 {
    public static void main(String[] args) {
//        System.out.println("김밥류 ==================="+
//        "1.원조김밥===========1500원"+
//        "2.치즈김밥===========2000원"+
//        "3.참치김밥===========2300원"+
//        "라면류 ==================="+
//        "4.그냥라면===========3000원"+
//        "5.치즈라면===========3500원"+
//        "6.짬뽕라면===========4000원"+
//        "분식류 ==================="+
//        "7.떡볶이=============2500원"+
//        "8.순대==============2500원"+
//        "9.오뎅==============1000원"+
//        "기타 ===================="+
//        "10.음료수===========1000원");

    }

}
